web/tutorials/precice/from_tut/fl2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wall
    {
        type            patch;
        nFaces          30;
        startFace       4218;
    }
    atmosphere
    {
        type            patch;
        nFaces          30;
        startFace       4248;
    }
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       4278;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       4350;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4320;
        startFace       4422;
    }
)

// ************************************************************************* //
